while True:
    print ("""█████████████████████████████████████████████████████████████████████████████████████████████████████████████▒* para finalizar presione Ctrl+c *▒█████████
█@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@█
█@@@@      %@@       @@       @@@  @@       ,@@@@@@       @, @@&       @@@      @@@@  @@@@  @@@@@  &@@@@@      @@@/     *@@, @@@@@@@@@@@@@@@@@@@@@@@@@@@@█
█@@@  @@@@@@@@  @@@@@@@  @@@@  @@  @@  @@@@@@@@@@@@ *@@@@@@, @@& /@@@, @@. &@@@  @@@ . @@@  @@@@    @@@@  @@@@  @@  @@@. &@, @@@@@@@@@@@@@@@@@@@@@@@@@@@@█
█@@@@    *@@@@      @@@       @@@  @@       @@@@@@@      @@, @@&      &@@  @@@@, @@@ @( %@  @@@@ %@  @@@  @@@@@@@@  @@@@@@@, @@@@@@@@@@@@@@@@@@@@@@@@@@@@█
█@@@@@@@@/ .@@  @@@@@@@  @@  @@@@  @@  @@@@@@@@@@@@ *@@@@@@, @@& /@@@  @@  @@@@, @@@ @@( %  @@@  @@& &@@  @@@@@@@@  @@@@@@@, @@@@@    @@@ @@@ %@/(@ @@ @@█
█@@@,@@@@@  @@  @@@@@@@  @@@  @@@  @@  @@@@@@@@@@@@ *@@@@@@, @@& /@@@  &@@  @@@  @@@ @@@@   @@        @@/  @@%  @@  @@@  @@, @@@@@   .@@ @ @@ @ /(@ @@ @@█
█@@@@     (@@@       @@  @@@@  @@  @@       ,@@@@@@ *@@@@@@, @@&      @@@@@    *@@@@ @@@@@  @% ,@@@@@  @@@    @@@@@*   *@@@, @@@@@ @@@@ @@@ @ @@ (@@  @@@█
█@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@█
██████████▒* para finalizar presione Ctrl+c *▒██████████████▒▒by Panu De Zan▒▒████████████████████████████████████████████████████████████████████████████""")
    usuario = input ("██████████████████████████████████████████████████████████████████████████████████████████████ INGRESE SU NOMBRE Y PRESIONE ENTER ██ -->>")

    print ("███████████████████████████████████████████████████████████████▒BIENVENIDO/A " + usuario + "▒███████████████████████████████████████████████████████████▒▒▒ ▒ ▒▒ ▒  ▒")
    print ("""
██████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████
██████████████████████████████████████████████████████ESTE ALGORITMO TE PERMITE HACER TRES COSAS... ██████████████████████████████████████████████████████ 
██████████████████████████████████████████████████████ 1 - Leer un breve articulo sobre la serie    ██████████████████████████████████████████████████████ 
██████████████████████████████████████████████████████ fibonacci (¿qué es?)                         ██████████████████████████████████████████████████████
██████████████████████████████████████████████████████ 2 - Calcular si un número entero pertenece a ██████████████████████████████████████████████████████
██████████████████████████████████████████████████████ los 50 primeros numeros de la serie fibonaci ██████████████████████████████████████████████████████
██████████████████████████████████████████████████████ original                                     ██████████████████████████████████████████████████████
██████████████████████████████████████████████████████ 3 - Crear una serie de fibonacci, solo los   ██████████████████████████████████████████████████████  
██████████████████████████████████████████████████████ primeros 50 números, a partir de  coordenas  ██████████████████████████████████████████████████████
██████████████████████████████████████████████████████ que vos ingreses (detalles en la seleción)   ██████████████████████████████████████████████████████
██████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████
__________________________________________________________________________________________________________________________________________________________
▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█ ENTONCES ██ INGRESÁ UNA OPCIÓN (1, 2, 3) Y PRESIONÁ ENTER █▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
""")

    def dialogar (voz_algoritmo):
        print ("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█ OK " + usuario + " tomaste una decisión...")
        print (voz_algoritmo)
        print ("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█ Si queres SALIR de este programa presioná Ctrl + c")
        print ("▒█████████████████████████████████████████████████████████████████████████████████████████████████████by Panu De Zan█████████████████████████████████████▒")


    opcion = int(input("------->>> "))
    if opcion == 1:
        dialogar ("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█ elegiste leer un breve articulo informativo sobre la serie fibonacci")
        input ("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█ ------->>> PRESIONA ENTER PARA CONTINUAR██████")
        print ("""
    ████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████
    ██@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@██
    █                                                                                                                                      █
    █ SUCESIÓN DE FIBONACCI                                                                                                                █
    █ En matemáticas, los números de Fibonacci, comúnmente denominados Fn, forman una secuencia, la secuencia de Fibonacci, en la que cada █
    █ número es la suma de los dos anteriores. La secuencia comúnmente comienza desde 0 y 1, aunque algunos autores comienzan la secuencia █ 
    █ desde 1 y 1 o, a veces, desde 1 y 2.                                                                                                 █
    █ ____________________________________________________________________________________________________________________________________ █
    █ Ejemplos:                                                                                                                            █
    █ Secuencia, o serie, Fibonacci original (inicia con 0 y 1): < 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89… >                              █
    █ Secuencia Fibonacci comenzando desde los valores 4 y 5: < 4, 5, 9, 14, 23, 37, 60, 97, 157, 254, 411, 665… >                         █
    █                                                                                                                                      █
    █                ██▒▒▒██                              ▒ Se representa en la siguiente fórmula:                                         █
    █               █▒▒▒▒▒▒██                             ▒ n = n-1 + n-2                                                                  █
    █              █▒▒▒▒▒▒▒██                             ▒                                                                                █
    █        　　　██▒▒▒▓▓▓▒▒██　　█                       ▒ Y en algoritmo de PYTHON se puede indicar de esta manera:                     █
    █        　　　█▒▒▒▓▓▓▓▒▒▒█　　　 █                    ▒ a = 0                                                                         █
    █        　　██▒▒▒▓▓▓▓▓▒▒█　　　█                      ▒ b = 1                                                                         █
    █        　　█▒▒▒▓▓▓▓▓▓▒▒█　　　█                      ▒                                                                               █
    █        　　█▒▒▒▓▓▓▓▓▓▒▒█ 　████ █ █ █                ▒    for k in range(n):                                                         █
    █        　　 ██▒▒▓▓▓▓▓▓▒▒█　█████　　█                ▒         c = a+b                                                               █
    █        　　　█▒▒▒▓▓▓▓▒▒▒██████                       ▒         a = b                                                                 █
    █        　　　██▒▒▒▓▓▒▒▒█████████████████___          ▒         b = c                                                                 █
    █        　　████▒▒▒▒▒▒██████▒▒▒▒▒▒▒▒▒▒▒▒███           ▒                                                                               █
    █        　██▒▒██▒▒▒▒██████▒▒▒▓▓▓▓▓▓▒▒▒▒▒██_           ▒         return b                                                              █
    █        ██▒▒▒▒██▒▒██████▒▒▒▓▓▓▓▓▓▓▓▒▒▒▒██_                                                                                            █
    █        █▒▒▒▒▒▒████████▒▒▒▓▓▓▓▓▓▓▓▓▒▒▒▒█_                                                                                             █ 
    █        █▒▒▒▒▒▒▒▒█████▒▒▒▓▓▓▓▓▓▓▓▓▒▒▒▒██                                                                                              █ 
    █        ██▒▒▒▒▒▒█████▒▒▒▒▓▓▓▓▓▓▓▓▒▒▒███___                                                                                            █ 
    █        　██▒▒▒▒▒███▒██▒▒▒▒▓▓▓▓▓▒▒▒▒██___                                                                                             █ 
    █        　　███████▒▒▒▒██▒▒▒▒▒▒▒▒▒████___                                                                                             █ 
    █        　　　　　　█▒▒▒▒▒▒▒██████████___                                                                                             █    
    █           　　 　　██▒▒▒▒▒▒▒██_____                                                                                                 █         
    █        　　　　　　　██▒▒▒▒▒▒██_____                                                                                                 █        
    █        　　　　　　　　██▒▒▒▒██____                                                                                                  █    
    █        　　　　　　　　　█████___     _______________________________________________________________________________________________█ 
    █ Esta sucesión fue descrita en Europa por Leonardo de Pisa, matemático italiano del siglo XIII también conocido como Fibonacci. Tiene █ 
    █ numerosas aplicaciones en ciencias de la computación, matemática y teoría de juegos. También aparece en configuraciones biológicas,  █
    █ como por ejemplo en las ramas de los árboles, en la disposición de las hojas en el tallo, en las flores de alcachofas y girasoles,en █ 
    █ las inflorescencias del brécol romanesco, en la configuración de las piñas de las coníferas, en la reproducción de los conejos y en  █
    █ cómo el ADN codifica el crecimiento de formas orgánicas complejas. De igual manera, se encuentra en la estructura espiral del        █
    █ caparazón de algunos moluscos, como el nautilus.                                                                                     █          
    ████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████
    """)
        input ("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█>>> PRESIONÁ ENTER PARA RELANZAR EL PROGRAMA, O Ctrl + c PARA SALIR")
    elif opcion == 2:
        fibonacci = [0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 6765, 10946, 17711, 28657, 46368, 75025, 121393, 196418, 317811, 514229, 832040, 1346269, 2178309, 3524578]
        dialogar ("""▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█ queres calcular si un número que ingreses pertenece a los primeros 50 elementos de fibonacci 
▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█ (debes considerar que este algoritmo sólo funciona con números enteros, positivos, y menores a 3600000)██""")
        input ("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█>> PRESIONA ENTER PARA CONTINUAR██████")
        print ("""
          ███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████
          ██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒>>>> A CONTINUACIÓN PUEDES INGRESAR UN NUMERO ENTERO (positivo y menor a 3600000) y este algoritmo     ██
          ██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒calculará si el número que ingresaste pertenece a alguno de los primero 50 números de la suseción      ██ 
          ██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒de Fibonacci original (aquella que comienza en 0, 1)                                                   ██
          ███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████
          ████████████████████████████████████████████████████████  **ATENCIÓN**  ███████████████████████████████████████████████████████████████
          █████████████████████████████████████████████ ESCRIBE EL VALOR SIN PUNTOS NI COMAS ████████████████████████████████████████████████████
          ████████████████████████████ (esta opción no trabaja con decimales, solo numeros enteros y positivos) █████████████████████████████████
          ███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████
    """)
        opcion2 = int(input("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█>> INGRESÁ EL NÚMERO Y PRESIONÁ ENTER ---->>> "))
        if opcion2 in fibonacci:
            print ("""
        ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█████████████  __^__                                      __^__  █████████████
        ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█████████████ ( ___ )------------------------------------( ___ ) █████████████
        ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█████████████  | / |                                      | \ |  █████████████
        ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█████████████  | / |   BRAVO!! EL VALOR PERTENECE A LOS   | \ |  █████████████
        ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█████████████  |___|   50 PRIMEROS ELEMENTOS FIBONACCI    |___|  █████████████
        ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█████████████ (_____)------------------------------------(_____) █████████████ 
        
        ▒ ▒ ▒ ▒▒  ▒▒  ▒▒ >>>>>>>>>>>>> EL NÚMERO INGRESADO EFECTIVAMENTE PERTENECE A ALGUNO DE LOS PRIMEROS 50 NÚMEROS DE LA 
                                       SUSECIÓN ORIGINAL DE FIBONACCI
        ___________________________________________________________________________________________________________________________________
        50 PRIMEROS ELEMENTOS FIBONACCI: 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181 
                                         6765, 10946, 17711, 28657, 46368, 75025, 121393, 196418, 317811, 514229, 832040, 1346269, 
                                         2178309, 3524578""")
            input ("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█>>> PRESIONÁ ENTER PARA RELANZAR EL PROGRAMA, O Ctrl + c PARA SALIR")
        elif opcion2 < 0:
            print ("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█// INGRESASTE UN NÚMERO MENOR A 0, ESTE ALGORITMO NO REALIZA ESE CÁLCULO")
            input ("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█>>> PRESIONÁ ENTER PARA RELANZAR EL PROGRAMA, O Ctrl + c PARA SALIR")
        elif opcion2 > 3600000:
            print ("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█// INGRESASTE UN NÚMERO DEMASIADO GRANDE PARA ESTE ALGORITMO")
            input ("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█>>> PRESIONÁ ENTER PARA RELANZAR EL PROGRAMA, O Ctrl + c PARA SALIR")
        else:
            print ("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█>> EL VALOR INGRESADO NO PERTENECE A LOS 50 VALORES INICIALES DE FIBONACCI")
            input ("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█>>> PRESIONÁ ENTER PARA RELANZAR EL PROGRAMA, O Ctrl + c PARA SALIR")
    elif opcion == 3:
        dialogar ("""
    ..██████████████████████████████** LEE CON ATENCIÓN **████████████████████████████████████████████████████████████████████████████████
    ..█ Vas a ingresar dos valores y generar a partir de ellos los 50 elementos fibonacci siguientes                                     █
    ..█ Para obtener la secuencia Fibonacci ORIGINAL debes ingresar 0 y 1, en ese orden: prinero 0 (origen), y luego 1 (rango)...        █
    ..█ de lo contrario, si ingresas valor diferentes a los indicados, obtendras una secuencia con la misma lógica de Fibonacci pero con █
    ..█ distinos valores a aquella que fue diseñada por Leonardo de Pissa (su creador)                                                   █
      ████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████
    """)
        input ("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█>> PRESIONA ENTER PARA CONTINUAR██████")
        print ("""
    ..████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████
    ..▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒>>>> A CONTINUACIÓN INGRESARAS DOS NUMEROS/ el primero indica el punto inicial de la serie y el segundo
    ..▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒indicará el rango de la frecuencia de repetición. El algoritmo calculará los sucesivos 50 números que    
    ..▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒componen los valores de la suseción de Fibonacci resultante (a partir de las coordenadas ingresadas)████
    ______________________________________________________________________________________________________________________________________
    ..████████████████████████RECUERDA! Sólo obtendras la secuencia verdadera (original) si el ORIGEN es igual a 0, y el RANGO igual a 1██
    °°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°
    """)
        input ("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█>> PRESIONA ENTER PARA CONTINUAR██████")
        aa = int(input("▒▒▒ ▒▒ ▒▒ ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒ ▒▒ ▒▒▒▒▒█INGRESAR valor de origen = "))
        print ("______________________________________________________________________________________________________________________________________")
        bb = int(input("▒▒▒▒▒▒   ▒▒▒ ▒▒▒▒▒▒▒▒▒▒▒ ▒▒▒ ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█INGRESAR valor de rango = "))
        print ("______________________________________________________________________________________________________________________________________")
        def fib(n):
            a = aa
            b = bb

            for k in range(n):
                c = a+b
                a = b
                b = c

            return b

        for x in range(50):
            print(fib(x))
        print ("""
    ______________________________________________________________________________________________________________________________________
    ██████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████
    ██████────────────██████                                                                                                         █████
    ██████──▄████▄▄░──██████     ¡¡EXCELENTE!!                                                                                       █████
    ██████─▄▀█▀▐└─┐░░─██████              LOS NÚMEROS DE ESA LISTA (ARRIBA) SON EL RESULTADO DE TUS COORDENADAS                      █████
    ██████─█▄▐▌▄█▄┘██─██████                                                                                                         █████        
    ██████─└▄▄▄▄▄┘███─██████                                                                                                         █████
    ██████ ██▒█▒███▀──████████████████████████████████████████████████████████████████████████████████████████████████████████████████████
    """)
        input ("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█>>> PRESIONÁ ENTER PARA RELANZAR EL PROGRAMA, O Ctrl + c PARA SALIR")

    else:
        print ("//////////////////// LA OPCIÓN INGRESADA NO ES VÁLIDA - ALGORITMO FINALIZADO")
